In [ ]:
# df.iloc[:1:4] #rows, #columns
# df.iloc[:1:4].agg(["max","min","mean"]).round(1)
# df.groupby("column_name").agg_function #NEED AGGREGATE FUNCTION
# df.groupby("room").max()
# df.groupby("room").agg(["min","max"])
# df.groupby("room").describe().T
# pd.concat([df1,df2, axis=0]) #0 is lengthwise 
# #use df.reset_index()
# pd.concat([df1,df2, axis=1]) #1 is widthwise
# #chnage names of columns to get rid of duplicates

In [ ]:
# pd.merge(users,roles,how="inner",left_on="role_id,right_on="id",indicator=True)

In [26]:
# from env import host, username, password, database
# # import pandas as pd

In [37]:
# def get_db_url3(user,password,host,database):
#     return f'mysql+pymysql://{username}:{password}@{host}/{database}'

In [162]:
# fix = mpg["trans"].unique()
# fix = np.delete(fix,1)
# fix = np.delete(fix,1)

In [41]:
# when pulling more than one column, use double brackets!!!!![[]]
# Boolean masking df.head()
# df.room == "B"
# mask = df.room == "B"
# df[mask].name
# df.reset_index()# resets index
# df.math.agg("min","max","mean")
# df.math.max("max")
# df[["math,","reading","english"]].agg(["max","min","mean"]).round(1)

NameError: name 'df' is not defined

In [1]:
from env import host, username, password, database
import pandas as pd
def get_db_url():
    url =f'mysql+pymysql://{username}:{password}@{host}/{database}'
    return url

In [44]:
from env import host, username, password, database
import pandas as pd

In [245]:


url =f'mysql+pymysql://{username}:{password}@{host}/{database}'

query = 'SELECT * FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(query,get_db_url())

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [3]:
pd.read_sql('select * from employees',get_db_url())

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
#Unknown columns error

query = 'SELECT ll FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(query,get_db_url())

In [48]:
employees = pd.read_sql('select * from employees', url)

In [51]:
titles = pd.read_sql('select * from titles', url)

In [39]:
#url =f'mysql+pymysql://{username}:{password}@{host}/{database}'
def get_db_url2():
    url2 =f'mysql+pymysql://{username}:{password}@{host}/{database}'
    return url2
        
query2 = 'SELECT * FROM titles'

pd.read_sql(query2,get_db_url2())

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [17]:
yo = pd.DataFrame(pd.read_sql(query,get_db_url()))
yo

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [55]:
employees.shape

(300024, 6)

In [52]:
titles.shape

(443308, 4)

In [59]:
titles.describe(include="all")

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [56]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [57]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [53]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [60]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [61]:
titles.title.unique().shape

(7,)

In [64]:
len(titles.title.unique())

7

In [62]:
titles.title.nunique()

7

In [63]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [65]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [219]:
import numpy as np
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [71]:
users.merge(roles,how="right",left_on="role_id",right_on="id",indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [72]:
users.merge(roles,how="left",left_on="role_id",right_on="id",indicator=True)

   id_x name_x  role_id  id_y    name_y     _merge
0     1    bob      1.0   1.0     admin       both
1     2    joe      2.0   2.0    author       both
2     3  sally      3.0   3.0  reviewer       both
3     4   adam      3.0   3.0  reviewer       both
4     5   jane      NaN   NaN       NaN  left_only
5     6   mike      NaN   NaN       NaN  left_only

In [73]:
users.merge(roles,how="inner",left_on="role_id",right_on="id",indicator=True)

   id_x name_x  role_id  id_y    name_y _merge
0     1    bob      1.0     1     admin   both
1     2    joe      2.0     2    author   both
2     3  sally      3.0     3  reviewer   both
3     4   adam      3.0     3  reviewer   both

In [74]:
users.merge(roles,how="outer",left_on="role_id",right_on="id",indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [220]:
messup= users.drop(columns="role_id")
#What happens if you drop the foreign keys from the DataFrames and try to merge them?
#Wont allow you to correctly connect and reference different tables

In [5]:
from pydataset import data
mpg = data('mpg') # load the dataset and store it in a variable

In [81]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [6]:
mpg.shape #234 rows 11 columns

(234, 11)

In [83]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [90]:
len(mpg.manufacturer.unique()) #15

15

In [94]:
len(mpg.model.unique()) #38

38

In [95]:
#shift+tab on mpg to read docs

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [98]:
mpg["mileage_difference"] = mpg["hwy"] - mpg["cty"]

In [158]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [224]:
mpg["average_mileage"] = (mpg["hwy"] + mpg["cty"])/2

In [163]:
# fix

array(['auto(l5)', 'auto(av)', 'auto(s6)', 'auto(l4)', 'auto(l3)',
       'auto(l6)', 'auto(s5)', 'auto(s4)'], dtype=object)

In [182]:
#automatic = (fix == "auto(l5)") | (fix == "auto(lav)") |(fix == "auto(l4)") | (fix == "auto(l3)") | (fix == "auto(l6)") | (fix == "auto(s5)") | (fix == "auto(s4)")

In [286]:
mpg["is_automatic"] = np.where(mpg.trans.str.startswith("auto"),True,False)

In [290]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_class,is_automatic,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,True,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,False,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,False,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,True,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,True,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,True,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,False,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,True,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,False,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,True,21.5

In [291]:
#volkswagon max mileage
mpg[["average_mileage","manufacturer"]].groupby("manufacturer").agg("max")

              average_mileage
manufacturer
audi                     25.5
chevrolet                26.0
dodge                    21.0
ford                     22.0
honda                    30.5
hyundai                  26.0
jeep                     19.5
land rover               15.0
lincoln                  15.0
mercury                  16.0
nissan                   27.5
pontiac                  23.0
subaru                   23.5
toyota                   32.5
volkswagen               39.5

In [292]:
#automatic best mileage for each car, same result -- FIX!!!
mpg.groupby('is_automatic').agg("mean")

TypeError: agg function failed [how->mean,dtype->object]

In [25]:
from env import host, username, password, database2
def get_db_url3():
    url3 =f'mysql+pymysql://{username}:{password}@{host}/{database2}'
    return url3
        
query3 = 'SELECT * FROM orders'

pd.read_sql(query3,get_db_url3())

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [162]:
chipotle.head(4)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39

In [170]:
chipotle["item_price"] = chipotle["item_price"].str.strip("$")

In [174]:
chipotle["item_price"] = chipotle["item_price"].astype(float)

In [192]:
# chipotle = pd.read_sql(query3,get_db_url3())

# # pd.crosstab(chipotle.order_id,chipotle.item_price,margins=True)
chipotle.groupby(chipotle.order_id).agg("sum")

,id,quantity,item_name,choice_description,item_price
order_id,,,,,
1,10,4,Chips and Fresh Tomato SalsaIzzeNantucket NectarChips and Tomatillo-Green Chili Salsa,nan[Clementine][Apple]nan,11.56
2,5,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98
3,13,2,Chicken BowlSide of Chips,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]nan",12.67
4,17,2,Steak BurritoSteak Soft Tacos,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",21.00
5,21,2,Steak BurritoChips and Guacamole,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]nan",13.70
...,...,...,...,...,...
1830,9223,2,Steak BurritoVeggie Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]][Tomatillo Green C...",23.00
1831,13842,3,Carnitas BowlChipsBottled Water,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream, Lettuc...",12.90
1832,9233,2,Chicken Soft TacosChips and Guacamole,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]nan",13.20
1833,9237,2,Steak BurritoSteak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]][Fres...",23.50
1834,13863,3,Chicken Salad BowlChicken Salad BowlChicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]][Fresh Tomat...",28.75

In [209]:
chipotle.groupby("item_name").agg("sum").sort_values(by="quantity",ascending=False)
#chicken bowl, chicken burrrito, chips and gaucamole
#chicken bowl also produced the most revenue

,id,order_id,quantity,choice_description,item_price
item_name,,,,,
Chicken Bowl,1780635,713926,761,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]][Fresh Tomat...",7342.73
Chicken Burrito,1238770,497303,591,"[Tomatillo-Green Chili Salsa (Medium), [Pinto Beans, Cheese, Sour Cream]][Fresh Tomato...",5575.82
Chips and Guacamole,1122252,449959,506,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,2201.04
Steak Burrito,818163,328437,386,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",3851.43
Canned Soft Drink,760291,304753,351,[Coke][Sprite][Coke][Coke][Lemonade][Sprite][Diet Coke][Coke][Coke][Coke][Sprite][Coke...,438.75
Chips,518915,208004,230,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,494.34
Steak Bowl,482932,193752,221,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cream]][T...",2260.19
Bottled Water,439516,175944,211,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,302.56
Chips and Fresh Tomato Salsa,250254,100419,130,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,361.36
Canned Soda,190019,76396,126,[Sprite][Dr. Pepper][Mountain Dew][Sprite][Dr. Pepper][Diet Dr. Pepper][Coca Cola][Die...,137.34
Chicken Salad Bowl,292402,117104,123,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]][Tomatillo Green Chili ...",1228.75
Chicken Soft Tacos,245006,98395,120,"[Roasted Chili Corn Salsa, [Rice, Black Beans, Cheese, Sour Cream]][Roasted Chili Corn...",1108.09
Side of Chips,211110,84769,110,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,185.90
Veggie Burrito,201416,80962,97,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream,...",934.77
Barbacoa Burrito,186070,74718,91,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green Chili Salsa (Medium), Tomatillo-Red Chili...",894.75
Veggie Bowl,180131,72270,87,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream, Guacam...",867.99
Carnitas Bowl,156667,62742,71,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cre...",736.71
Barbacoa Bowl,134330,53972,66,"[Roasted Chili Corn Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream, ...",672.36
Carnitas Burrito,128670,51652,60,"[[Tomatillo-Green Chili Salsa (Medium), Roasted Chili Corn Salsa (Medium)], [Black Bea...",597.83
Steak Soft Tacos,125067,50177,56,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]][Fresh Tomato...",536.05
6 Pack Soft Drink,130372,52322,55,[Sprite][Diet Coke][Coke][Diet Coke][Diet Coke][Diet Coke][Diet Coke][Nestea][Coke][Co...,356.95
Chips and Tomatillo Red Chili Salsa,113633,45556,50,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,147.50
Chicken Crispy Tacos,118440,47382,50,"[Roasted Chili Corn Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream]]...",472.13
Chips and Tomatillo Green Chili Salsa,102478,41170,45,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,132.75
Carnitas Soft Tacos,93806,37673,40,"[Tomatillo Green Chili Salsa, [Fajita Vegetables, Pinto Beans, Cheese]][Fresh Tomato S...",375.94
Steak Crispy Tacos,89443,35818,36,"[Fresh Tomato Salsa, Sour Cream][[Roasted Chili Corn Salsa (Medium), Tomatillo-Green C...",357.34
Chips and Tomatillo-Green Chili Salsa,54242,21826,33,nannannannannannannannannannannannannannannannannannannannannannannannannannannannanna...,78.87
Steak Salad Bowl,73982,29590,31,"[Tomatillo Red Chili Salsa, [Black Beans, Cheese, Guacamole]][Fresh Tomato Salsa, [Pin...",343.59
Nantucket Nectar,54430,21814,29,[Apple][Pomegranate Cherry][Pineapple Orange Banana][Apple][Peach Orange][Pomegranate ...,98.31
Chips and Tomatillo-Red Chili Salsa,45670,18344,25,nannannannannannannannannannannannannannannannannannannannan,59.75
Barbacoa Soft Tacos,46479,18725,25,"[Fresh Tomato Salsa, [Fajita Vegetables, Black Beans, Lettuce]][Tomatillo Red Chili Sa...",250.46
Chips and Roasted Chili Corn Salsa,37174,14999,23,nannannannannannannannannannannannannannannannannannannannannannan,67.85
Izze,26300,10587,20,[Clementine][Grapefruit][Blackberry][Blackberry][Blackberry][Grapefruit][Grapefruit][C...,67.80
Veggie Salad Bowl,43142,17303,18,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream, Guacam...",182.50
Chips and Roasted Chili-Corn Salsa,43572,17462,18,nannannannannannannannannannannannannannannannannannan,43.02
Barbacoa Crispy Tacos,13836,5613,12,"[Tomatillo Red Chili Salsa, [Rice, Black Beans, Cheese, Sour Cream, Guacamole]][Roaste...",120.21
Barbacoa Salad Bowl,24171,9708,10,"[Fresh Tomato Salsa, [Rice, Fajita Vegetables, Pinto Beans, Black Beans, Sour Cream, C...",106.40
Chicken Salad,26134,10465,9,"[Roasted Chili Corn Salsa (Medium), [Black Beans, Rice, Fajita Veggies, Cheese, Sour C...",81.09
Carnitas Crispy Tacos,14574,5868,8,"[Roasted Chili Corn Salsa][Tomatillo Green Chili Salsa, [Rice, Black Beans, Cheese, So...",77.96
Veggie Soft Tacos,13744,5520,8,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Guacamole, ...",73.96
Burrito,3740,1550,6,"[Adobo-Marinated and Grilled Chicken, Pinto Beans, [Sour Cream, Salsa, Cheese, Cilantr...",44.40
Veggie Salad,18170,7265,6,"[[Fresh Tomato Salsa (Mild), Roasted Chili Corn Salsa (Medium)], [Rice, Fajita Veggies...",50.94
Carnitas Salad Bowl,16716,6693,6,"[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Guacamole]][Fresh Tomato Salsa, [Rice...",66.34
Bowl,1120,472,4,"[Braised Carnitas, Pinto Beans, [Sour Cream, Cheese, Cilantro-Lime Rice]][Adobo-Marina...",29.60
Steak Salad,5815,2362,4,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Fajita Veggies, Cheese, Lettuce]...",35.66
Salad,2831,1150,2,"[Brown Rice, Adobo-Marinated and Grilled Chicken, Vegetarian Black Beans][White Rice, ...",14.80
Crispy Tacos,1043,434,2,[Adobo-Marinated and Grilled Steak][Adobo-Marinated and Grilled Chicken],14.80
Chips and Mild Fresh Tomato Salsa,675,279,1,nan,3.00
Carnitas Salad,3751,1500,1,"[[Fresh Tomato Salsa (Mild), Roasted Chili Corn Salsa (Medium)], [Black Beans, Rice, C...",8.99
Veggie Crispy Tacos,1654,668,1,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice, Cheese, Sour Cream]]",8.49

In [230]:
query5 = '''SELECT * FROM employees 
                        join titles
                            using(emp_no)
                            '''
joined= pd.read_sql(query5,get_db_url())
joined

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [232]:
joined.groupby("title").hire_date.agg("max")

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [233]:
pd.read_sql("show tables",url)

  Tables_in_employees
0         departments
1            dept_emp
2        dept_manager
3           employees
4            salaries
5              titles

In [234]:
query6 = '''SELECT * FROM dept_emp
                        join departments
                            using(dept_no)
                            '''

In [258]:
df_depts = pd.read_sql(query6, url)

In [249]:
titles = pd.read_sql('select * from titles', url)

In [250]:
employees = pd.read_sql('select * from employees', url)

In [259]:
df_emps = pd.merge(employees,titles,how= "inner",on="emp_no")

In [262]:
join_all=pd.merge(df_emps, df_depts,how="inner",on="emp_no")
join_all.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date_x,to_date_x,dept_no,from_date_y,to_date_y,dept_name
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01,Development
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,d007,1996-08-03,9999-01-01,Sales
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,d004,1995-12-03,9999-01-01,Production
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,d004,1986-12-01,9999-01-01,Production
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,d004,1986-12-01,9999-01-01,Production

In [263]:
pd.crosstab(join_all.title,join_all.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0

In [276]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Index: 234 entries, 1 to 234
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   manufacturer     234 non-null    object
 1   model            234 non-null    object
 2   displ            234 non-null    float64
 3   year             234 non-null    int64
 4   cyl              234 non-null    int64
 5   trans            234 non-null    object
 6   drv              234 non-null    object
 7   cty              234 non-null    int64
 8   hwy              234 non-null    int64
 9   fl               234 non-null    object
 10  class            234 non-null    object
 11  is_automatic     234 non-null    bool
 12  average_mileage  234 non-null    float64
dtypes: bool(1), float64(2), int64(4), object(6)
memory usage: 24.0+ KB

In [277]:
mpg = mpg.rename(columns={'class':'car_class'})

In [278]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_class,is_automatic,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,True,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,False,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,False,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,True,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,True,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,True,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,False,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,True,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,False,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,True,21.5